Q1. Create a table called employees with the following structure
emp_id (integer, should not be NULL and should be a primary key)

emp_name (text, should not be NULL)

age (integer, should have a check constraint to ensure the age is at least 18)

email (text, should be unique for each employee)

salary (decimal, with a default value of 30,000).

Write the SQL query to create the above table with all constraints.

Answer
CREATE TABLE employees (
    emp_id INT PRIMARY KEY NOT NULL,
    emp_name VARCHAR(100) NOT NULL,
    age INT CHECK (age >= 18),
    email VARCHAR(100) UNIQUE,
    salary DECIMAL(10,2) DEFAULT 30000
);

Q2. Explain the purpose of constraints and how they help maintain data integrity in a database. Provide examples of common types of constraints.

Answer:

Constraints enforce rules on data to maintain accuracy and consistency.

PRIMARY KEY: Ensures each record is unique.

FOREIGN KEY: Maintains referential integrity between tables.

NOT NULL: Prevents missing values.

UNIQUE: Ensures no duplicate entries.

CHECK: Restricts values to certain conditions.

Q3. Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify your answer.

Answer:

NOT NULL ensures that a column always has a value, preventing incomplete data.

A Primary Key cannot contain NULL values because it must uniquely identify each record, and NULL would break uniqueness.

Q4. Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an example for both adding and removing a constraint.

Answer:

Add constraint:

ALTER TABLE employees
ADD CONSTRAINT chk_age CHECK (age >= 18);
Remove constraint:

ALTER TABLE employees
DROP CONSTRAINT chk_age;

Q5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints. Provide an example of an error message that might occur when violating a constraint.
Answer:
When a constraint is violated, the database rejects the operation and raises an error.


INSERT INTO employees (emp_id, emp_name, age, salary)
VALUES (1, 'John', 15, 25000);

 Error: CHECK constraint failed: age >= 18

Q6. You created a products table without constraints as follows:

CREATE TABLE products (
    product_id INT,
    product_name VARCHAR(50),
    price DECIMAL(10, 2)
);
Now, you realise that

The product_id should be a primary key

The price should have a default value of 50.00

Answer:

ALTER TABLE products
ADD CONSTRAINT pk_product PRIMARY KEY (product_id);

ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;

Q7. You have two tables:
Write a query to fetch the student_name and class_name for each student using an INNER JOIN

Answer:

SELECT s.student_name, c.class_name
FROM students s
INNER JOIN classes c
ON s.class_id = c.class_id;

Q8. Consider the following three tables:
Write a query that shows all order_id, customer_name, and product_name, ensuring that all products are listed even if they are not associated with an order.
Hint: (use INNER JOIN and LEFT JOIN)

Answer:

sql
Copy
Edit
SELECT o.order_id, c.customer_name, p.product_name
FROM products p
LEFT JOIN orders o ON p.product_id = o.product_id
LEFT JOIN customers c ON o.customer_id = c.customer_id;

Q9. Given the following tables:
Write a query to find the total sales amount for each product using an INNER JOIN and the SUM() function.

Answer:

SELECT p.product_name, SUM(o.quantity * p.price) AS total_sales
FROM orders o
INNER JOIN products p ON o.product_id = p.product_id
GROUP BY p.product_name;

Q10. You are given three tables:
Write a query to display the order_id, customer_name, and the quantity of products ordered by each customer using an INNER JOIN between all three tables

Answer:

SELECT o.order_id, c.customer_name, SUM(o.quantity) AS total_quantity
FROM orders o
INNER JOIN customers c ON o.customer_id = c.customer_id
INNER JOIN products p ON o.product_id = p.product_id
GROUP BY o.order_id, c.customer_name;

                                      SQL Commands

Q1. Identify the primary keys and foreign keys in the Maven Movies DB.

Answer:

Primary Keys

actor.actor_id

film.film_id

customer.customer_id

rental.rental_id

payment.payment_id

inventory.inventory_id

store.store_id

category.category_id

Foreign Keys

film_actor.actor_id → actor.actor_id

film_actor.film_id → film.film_id

film_category.film_id → film.film_id

film_category.category_id → category.category_id

rental.customer_id → customer.customer_id

rental.inventory_id → inventory.inventory_id

inventory.film_id → film.film_id

payment.rental_id → rental.rental_id

payment.customer_id → customer.customer_id

store.manager_staff_id → staff.staff_id

Q2. List all details of actors.

Answer:

SELECT *
FROM actor;

Q3. List all customer information.

Answer:

SELECT *
FROM customer;

Q4. List different countries.

Answer:

SELECT DISTINCT country
FROM country;

Q5. Display all active customers.

Answer:

SELECT customer_id, first_name, last_name, email
FROM customer
WHERE active = 1;

Q6. List rental IDs for customer with ID 1.

Answer:

SELECT rental_id
FROM rental
WHERE customer_id = 1

Q7. Display all films whose rental duration is greater than 5.

Answer

SELECT film_id, title, rental_duration
FROM film
WHERE rental_duration > 5;

Q8. Find the count of films with replacement cost between $15 and $20.

Answer

SELECT COUNT(*) AS film_count
FROM film
WHERE replacement_cost BETWEEN 15 AND 20;

Q9. Find the count of unique first names of actors.

Answer:

SELECT COUNT(DISTINCT first_name) AS unique_first_names
FROM actor;

Q10. Display the first 10 customers from the customer table.

Answer:

SELECT customer_id, first_name, last_name
FROM customer
LIMIT 10;

Q11. Display the first 3 customers whose name starts with ‘b’.

Answer

SELECT customer_id, first_name, last_name
FROM customer
WHERE first_name LIKE 'B%'
LIMIT 3;

Q12. Display the first 5 movies which are rated ‘G’.

Answer

SELECT film_id, title, rating
FROM film
WHERE rating = 'G'
LIMIT 5;

Q13. Find all customers whose first name starts with ‘a’.

Answer

SELECT customer_id, first_name, last_name
FROM customer
WHERE first_name LIKE 'A%';

Q14. Find all customers whose first name ends with ‘a’.

Answer

SELECT customer_id, first_name, last_name
FROM customer
WHERE first_name LIKE '%a';

Q15. Display the list of first names of all customers containing the character ‘NI’ together.

Answer

SELECT customer_id, first_name, last_name
FROM customer
WHERE first_name LIKE '%NI%';

Q16. Find all customers whose first name has ‘r’ in the second position.

Answer

SELECT customer_id, first_name, last_name
FROM customer
WHERE first_name LIKE '_r%';

Q17. Find all customers whose first name starts with ‘a’ and is at least 5 characters in length.

Answer

SELECT customer_id, first_name, last_name
FROM customer
WHERE first_name LIKE 'A%'
AND LENGTH(first_name) >= 5;

Q18. Find all customers whose first name starts with ‘a’ and ends with ‘o’.

Answer

SELECT customer_id, first_name, last_name
FROM customer
WHERE first_name LIKE 'A%o';

Q19. Get the cities of customers whose first name starts with ‘a’.

Answer

SELECT c.first_name, ci.city
FROM customer c
JOIN address a ON c.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
WHERE c.first_name LIKE 'A%';

Q20. Find all the films whose rating is either ‘PG’ or ‘PG-13’.

Answer

SELECT film_id, title, rating
FROM film
WHERE rating IN ('PG', 'PG-13');

Q21. Find all the films whose length is between 50 and 100.

Answer

SELECT film_id, title, length
FROM film
WHERE length BETWEEN 50 AND 100;

Q22. Display the top 50 actors in ascending order of their first name.

Answer

SELECT actor_id, first_name, last_name
FROM actor
ORDER BY first_name ASC
LIMIT 50;

Q23. List the distinct film IDs from the inventory table.

Answer

SELECT DISTINCT film_id
FROM inventory;

                                  SQL Functions

Q1. Find the total number of rentals in the Maven Movies DB.

Answer

SELECT COUNT(*) AS total_rentals
FROM rental;

Q2. Find the average rental duration of films.

Answer

SELECT AVG(rental_duration) AS avg_rental_duration
FROM film;

Q3. Find the total revenue generated from all payments.

Answer

SELECT SUM(amount) AS total_revenue
FROM payment;

Q4. Display all customer first names in uppercase.

Answer

SELECT UPPER(first_name) AS customer_first_name
FROM customer;

Q5. Display the first 3 characters of each customer’s first name.

Answer

SELECT SUBSTRING(first_name, 1, 3) AS first_three_chars
FROM customer;

Q6. Extract the month from the rental date in the rental table.

Answer

SELECT rental_id, EXTRACT(MONTH FROM rental_date) AS rental_month
FROM rental;

Q7. Find the number of rentals made by each customer (use GROUP BY).

Answer

SELECT customer_id, COUNT(rental_id) AS total_rentals
FROM rental
GROUP BY customer_id;

Q8. Find the total revenue generated by each store.

Answer

SELECT s.store_id, SUM(p.amount) AS total_revenue
FROM payment p
JOIN staff st ON p.staff_id = st.staff_id
JOIN store s ON st.store_id = s.store_id
GROUP BY s.store_id;

                                     SQL Joins

Q1. Write a query to display the movie title and the customer’s first and last name who rented it.

Answer

SELECT f.title, c.first_name, c.last_name
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN customer c ON r.customer_id = c.customer_id;

Q2. Find the names of all the actors who acted in the movie ‘Gone with the Wind’.

Answer

SELECT a.first_name, a.last_name
FROM actor a
JOIN film_actor fa ON a.actor_id = fa.actor_id
JOIN film f ON fa.film_id = f.film_id
WHERE f.title = 'Gone with the Wind';

Q3. Write a query to display the first and last names of customers along with the total amount they have spent on rentals.

Answer

SELECT c.first_name, c.last_name, SUM(p.amount) AS total_spent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.first_name, c.last_name
ORDER BY total_spent DESC;

Q4. Display the customer name and the total number of movies rented by customers living in ‘London’.

Answer

SELECT c.first_name, c.last_name, COUNT(r.rental_id) AS total_movies
FROM customer c
JOIN address a ON c.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN rental r ON c.customer_id = r.customer_id
WHERE ci.city = 'London'
GROUP BY c.first_name, c.last_name;

Q5. Write a query to display the top 5 most rented movies.

Answer

SELECT f.title, COUNT(r.rental_id) AS rental_count
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY f.title
ORDER BY rental_count DESC
LIMIT 5;

Q6. Display the names of customers who have rented movies from both stores.

Answer

SELECT c.first_name, c.last_name
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN store s ON i.store_id = s.store_id
GROUP BY c.customer_id, c.first_name, c.last_name
HAVING COUNT(DISTINCT s.store_id) = 2;

                                    Window Functions

Q1. Write a query to rank customers based on the total amount they have spent, with the highest spender ranked first.

Answer

SELECT c.first_name, c.last_name, SUM(p.amount) AS total_spent,
       RANK() OVER (ORDER BY SUM(p.amount) DESC) AS customer_rank
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name;

Q2. Write a query to calculate the cumulative revenue generated by each film.

Answer

SELECT f.title, SUM(p.amount) AS film_revenue,
       SUM(SUM(p.amount)) OVER (ORDER BY f.title) AS cumulative_revenue
FROM payment p
JOIN rental r ON p.rental_id = r.rental_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
GROUP BY f.title
ORDER BY f.title;

Q3. Write a query to find the average rental duration for each film length, and compare each film’s rental duration with its category average.

Answer

SELECT f.title, f.length, f.rental_duration,
       AVG(f.rental_duration) OVER (PARTITION BY f.length) AS avg_duration
FROM film f;

Q4. Write a query to rank films within each category by their rental rate.

Answer

SELECT c.name AS category, f.title, f.rental_rate,
       RANK() OVER (PARTITION BY c.name ORDER BY f.rental_rate DESC) AS film_rank
FROM film f
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id;

Q5. Write a query to find the monthly revenue trend for the year 2005.

Answer

SELECT EXTRACT(MONTH FROM p.payment_date) AS month,
       SUM(p.amount) AS monthly_revenue
FROM payment p
WHERE EXTRACT(YEAR FROM p.payment_date) = 2005
GROUP BY EXTRACT(MONTH FROM p.payment_date)
ORDER BY month;

Q6. Write a query to find the top 20% of customers based on their total spending.

Answer

WITH ranked_customers AS (
    SELECT c.customer_id, c.first_name, c.last_name, SUM(p.amount) AS total_spent,
           NTILE(5) OVER (ORDER BY SUM(p.amount) DESC) AS percentile_rank
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
)
SELECT first_name, last_name, total_spent
FROM ranked_customers
WHERE percentile_rank = 1;

Q7. Write a query to display a running total of revenue generated over time.

Answer

SELECT p.payment_date, p.amount,
       SUM(p.amount) OVER (ORDER BY p.payment_date) AS running_total
FROM payment p
ORDER BY p.payment_date;

Q8. Write a query to find all films that have been rented less than the average number of rentals.

Answer

WITH film_rentals AS (
    SELECT f.film_id, f.title, COUNT(r.rental_id) AS rental_count
    FROM film f
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY f.film_id, f.title
)
SELECT title, rental_count
FROM film_rentals
WHERE rental_count < (SELECT AVG(rental_count) FROM film_rentals);

Q9. Write a query to display the top 5 months with the highest revenue.

Answer

SELECT TO_CHAR(p.payment_date, 'YYYY-MM') AS month, SUM(p.amount) AS total_revenue
FROM payment p
GROUP BY TO_CHAR(p.payment_date, 'YYYY-MM')
ORDER BY total_revenue DESC
LIMIT 5;

Q10. Write a query to calculate the difference between each film’s rental count and the average rental count.

Answer

WITH film_counts AS (
    SELECT f.title, COUNT(r.rental_id) AS rental_count
    FROM film f
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY f.title
)
SELECT title, rental_count,
       rental_count - (SELECT AVG(rental_count) FROM film_counts) AS diff_from_avg
FROM film_counts;

                                                     Normalization & CTEs

Q1. Explain normalization and its different normal forms. Identify a table in the Maven Movies DB that is not normalized and explain how you would normalize it.

Answer:

Normalization is the process of organizing data to reduce redundancy and improve integrity.

Normal Forms:

1NF: Eliminate repeating groups (atomic values only).

2NF: 1NF + no partial dependency on part of a composite key.

3NF: 2NF + no transitive dependency.

Example:
In Maven Movies, if a table combined customer details and rental info together, it would violate 1NF.
We normalize by splitting into separate tables:

customer(customer_id, name, email, address_id)

rental(rental_id, customer_id, inventory_id, rental_date)
linked via foreign keys.

Q2. Write a CTE to display the total number of films each actor has acted in.

Answer

WITH actor_films AS (
    SELECT a.actor_id, a.first_name, a.last_name, COUNT(fa.film_id) AS film_count
    FROM actor a
    JOIN film_actor fa ON a.actor_id = fa.actor_id
    GROUP BY a.actor_id, a.first_name, a.last_name
)
SELECT first_name, last_name, film_count
FROM actor_films;

Q3. Write a CTE to display all films along with their language.

Answer

WITH film_lang AS (
    SELECT f.title, l.name AS language
    FROM film f
    JOIN language l ON f.language_id = l.language_id
)
SELECT title, language
FROM film_lang;

Q4. Write a CTE to display the total revenue generated by each customer.

Answer

WITH customer_revenue AS (
    SELECT c.customer_id, c.first_name, c.last_name, SUM(p.amount) AS total_revenue
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
)
SELECT first_name, last_name, total_revenue
FROM customer_revenue;

Q5. Write a CTE to rank films based on their rental duration.

Answer

WITH ranked_films AS (
    SELECT title, rental_duration,
           RANK() OVER (ORDER BY rental_duration DESC) AS duration_rank
    FROM film
)
SELECT title, rental_duration, duration_rank
FROM ranked_films;

Q6. Write a CTE to display customers who have rented more than 2 movies.

Answer

WITH customer_rentals AS (
    SELECT c.customer_id, c.first_name, c.last_name, COUNT(r.rental_id) AS rentals
    FROM customer c
    JOIN rental r ON c.customer_id = r.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
)
SELECT first_name, last_name, rentals
FROM customer_rentals
WHERE rentals > 2;

Q7. Write a CTE to display the number of rentals per month.

Answer

WITH monthly_rentals AS (
    SELECT EXTRACT(MONTH FROM rental_date) AS month, COUNT(rental_id) AS rental_count
    FROM rental
    GROUP BY EXTRACT(MONTH FROM rental_date)
)
SELECT month, rental_count
FROM monthly_rentals
ORDER BY month;

Q8. Write a CTE to find all pairs of actors who acted together in the same film.

Answer

WITH actor_pairs AS (
    SELECT fa1.film_id, a1.first_name || ' ' || a1.last_name AS actor1,
           a2.first_name || ' ' || a2.last_name AS actor2
    FROM film_actor fa1
    JOIN film_actor fa2 ON fa1.film_id = fa2.film_id AND fa1.actor_id < fa2.actor_id
    JOIN actor a1 ON fa1.actor_id = a1.actor_id
    JOIN actor a2 ON fa2.actor_id = a2.actor_id
)
SELECT film_id, actor1, actor2
FROM actor_pairs;

Q9. Write a recursive CTE to display all employees who report to a given manager.

Answer

WITH RECURSIVE employee_hierarchy AS (
    SELECT staff_id, first_name, last_name, manager_id
    FROM staff
    WHERE manager_id IS NULL   -- Top manager
    
    UNION ALL
    
    SELECT s.staff_id, s.first_name, s.last_name, s.manager_id
    FROM staff s
    JOIN employee_hierarchy eh ON s.manager_id = eh.staff_id
)
SELECT *
FROM employee_hierarchy;


Q10. Write a CTE to find the top 3 films in each category based on rental rate.

Answer

WITH ranked_films AS (
    SELECT c.name AS category, f.title, f.rental_rate,
           RANK() OVER (PARTITION BY c.name ORDER BY f.rental_rate DESC) AS rank_no
    FROM film f
    JOIN film_category fc ON f.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
)
SELECT category, title, rental_rate
FROM ranked_films
WHERE rank_no <= 3;

Q11. Write a CTE to find customers who have spent more than the average amount.

Answer

WITH customer_spend AS (
    SELECT c.customer_id, c.first_name, c.last_name, SUM(p.amount) AS total_spent
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id, c.first_name, c.last_name
)
SELECT first_name, last_name, total_spent
FROM customer_spend
WHERE total_spent > (SELECT AVG(total_spent) FROM customer_spend);

Q12. Write a CTE to find the film that generated the maximum revenue.

Answer

WITH film_revenue AS (
    SELECT f.film_id, f.title, SUM(p.amount) AS revenue
    FROM film f
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    JOIN payment p ON r.rental_id = p.rental_id
    GROUP BY f.film_id, f.title
)
SELECT title, revenue
FROM film_revenue
ORDER BY revenue DESC
LIMIT 1;